littleLibrary/app/controllers/api/v1/books_controller.rb

SELECT `books`.* FROM `books` ORDER BY title ASC
---
      def index
        books = Book.order('title ASC')

INSERT INTO `books` (`title`, `author`, `available`, `created_at`, `updated_at`) VALUES ('My First Book', 'Vincent Hughes', TRUE, '2019-11-05 08:04:42.028686', '2019-11-05 08:04:42.028686')
---
      def create
        book = Book.new(book_params)

        if book.save

SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
      def show
        book = Book.find(params[:id])

SELECT `books`.* FROM `books` WHERE `books`.`id` = 20 LIMIT 1
UPDATE `books` SET `books`.`title` = 'NEW TITLE', `books`.`author` = 'Cro Magnon', `books`.`updated_at` = '2019-11-05 08:14:38.793631' WHERE `books`.`id` = 20
---
      def update
        book = Book.find(params[:id])
        if book.update_attributes(book_params)

SELECT `books`.* FROM `books` WHERE `books`.`id` = 21 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 21
---
      def destroy
        book = Book.find(params[:id])
        book.destroy